edb-test-1/README.org
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:t todo:t |:t
#+title: EDB Test Plan
#+date: <2022-06-03 Fri>
#+author: David A. Ventimiglia
#+email: davidaventimiglia@hasura.io
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 29.0.50 (Org mode 9.5.3)
#+cite_export:

* Databases
** Postgres
*** Schema
**** DONE Table Basics
- [X] Add database
- [X] Add account and product tables
- [X] Add account and product data
- [X] Perform CRUD operations
  - Read
    #+begin_src graphql
      query MyQuery {
        account(order_by: {name: asc}, limit: 10) {
          id
          name
          created_at
          updated_at
        }
      }
    #+end_src
    #+begin_src graphql
      query MyQuery {
        product(order_by: {price: asc}, limit: 10) {
          id
          name
          price
          updated_at
          created_at
        }
      }
    #+end_src
  - Insert
    #+begin_src graphql
      mutation MyMutation {
        insert_account(objects: {name: "John Doe"}) {
          affected_rows
        }
      }
    #+end_src
    #+begin_src graphql
      mutation MyMutation {
        insert_product(objects: {name: "Doughnut", price: 100}) {
          returning {
            id
            name
            price
            updated_at
            created_at
          }
        }
      }
    #+end_src
  - Update
    #+begin_src graphql
      mutation MyMutation {
        update_account(where: {name: {_eq: "John Doe"}}, _set: {name: "Jane Doe"}) {
          affected_rows
        }
      }
    #+end_src
  - Delete
    #+begin_src graphql
    mutation MyMutation {
        delete_product(where: {name: {_eq: "Doughnut"}}) {
          affected_rows
        }
      }
    #+end_src
**** DONE Table Relationships
- [X] Add the order and order detail tables
- [X] Add relationships for account, order, order detail, and product
- [X] Generate order and order detail data
- [X] Perform queries across relationships
  #+begin_src graphql
    query MyQuery {
      account(limit: 2) {
        id
        name
        created_at
        updated_at
        orders {
          id
          created_at
          updated_at
          order_details {
            id
            created_at
            updated_at
            units
            product {
              id
              name
              created_at
              updated_at
              price
            }
          }
        }
      }
    }
  #+end_src
