edb-test-1/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-02 Fri 15:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>EDB Test Plan</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="David A. Ventimiglia" />
</head>
<body>
<div id="content">
<h1 class="title">EDB Test Plan</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0f879b7">1. Databases</a>
<ul>
<li><a href="#org42a567a">1.1. Postgres</a></li>
<li><a href="#org39badf7">1.2. Schema</a>
<ul>
<li><a href="#orgd282426">1.2.1. <span class="done DONE">DONE</span> Table Basics</a></li>
<li><a href="#org3bd7f61">1.2.2. <span class="done DONE">DONE</span> Table Relationships</a></li>
<li><a href="#orgaa1462d">1.2.3. <span class="todo TODO">TODO</span> Remote Relationships&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOES_NOT_INVOLVE_DB">DOES_NOT_INVOLVE_DB</span></span></a></li>
<li><a href="#orgbe36160">1.2.4. <span class="done DONE">DONE</span> Extend with Views</a></li>
<li><a href="#org600a17d">1.2.5. <span class="done DONE">DONE</span> Extend with SQL Functions</a></li>
<li><a href="#org6ad4c4b">1.2.6. <span class="done DONE">DONE</span> Default field values</a></li>
<li><a href="#orgc9bf8b2">1.2.7. <span class="done DONE">DONE</span> Enum type fields</a></li>
<li><a href="#org1e4cc51">1.2.8. <span class="done DONE">DONE</span> Computed fields</a></li>
<li><a href="#orgaa6ae38">1.2.9. <span class="done DONE">DONE</span> Customize auto-generated fields&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOES_NOT_INVOLVE_DB">DOES_NOT_INVOLVE_DB</span></span></a></li>
<li><a href="#org94d0c5b">1.2.10. <span class="done DONE">DONE</span> Data validations</a></li>
<li><a href="#orgf89ca92">1.2.11. <span class="done DONE">DONE</span> Using an existing database</a></li>
<li><a href="#org8670011">1.2.12. <span class="done DONE">DONE</span> Relay Schema&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOES_NOT_INVOLVE_DB">DOES_NOT_INVOLVE_DB</span></span></a></li>
</ul>
</li>
<li><a href="#org5ca6940">1.3. Queries</a>
<ul>
<li><a href="#orgb888a2f">1.3.1. <span class="done DONE">DONE</span> Simple object queries</a></li>
<li><a href="#orgafbe33c">1.3.2. <span class="done DONE">DONE</span> Nested object queries</a></li>
<li><a href="#orgc9ef7f0">1.3.3. <span class="done DONE">DONE</span> Aggregation queries</a></li>
<li><a href="#org4104d9b">1.3.4. <span class="done DONE">DONE</span> Filter query results / search queries</a></li>
<li><a href="#org457feea">1.3.5. <span class="done DONE">DONE</span> Sort query results</a></li>
<li><a href="#org2e05c88">1.3.6. <span class="done DONE">DONE</span> Distinct query results</a></li>
<li><a href="#org174fd8c">1.3.7. <span class="todo TODO">TODO</span> Using multiple arguments&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOES_NOT_INVOLVE_DB">DOES_NOT_INVOLVE_DB</span></span></a></li>
<li><a href="#orgab3a3e2">1.3.8. <span class="todo TODO">TODO</span> Multiple queries in a request&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOES_NOT_INVOLVE_DB">DOES_NOT_INVOLVE_DB</span></span></a></li>
<li><a href="#orgd058a4c">1.3.9. <span class="todo TODO">TODO</span> Using variables / aliases / fragments / directives&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOES_NOT_INVOLVE_DB">DOES_NOT_INVOLVE_DB</span></span></a></li>
<li><a href="#org16a9ab9">1.3.10. <span class="todo TODO">TODO</span> Query performance</a></li>
</ul>
</li>
<li><a href="#orgfc24c1e">1.4. Mutations</a>
<ul>
<li><a href="#orga73c3bd">1.4.1. <span class="done DONE">DONE</span> Insert</a></li>
<li><a href="#org38d9b7e">1.4.2. <span class="todo TODO">TODO</span> Upsert</a></li>
<li><a href="#orgf636ae9">1.4.3. <span class="done DONE">DONE</span> Update</a></li>
<li><a href="#org46dcbc3">1.4.4. <span class="todo TODO">TODO</span> Delete</a></li>
<li><a href="#orga6285c5">1.4.5. <span class="todo TODO">TODO</span> Multiple mutations in a request</a></li>
</ul>
</li>
<li><a href="#orge222e0f">1.5. Subscriptions</a>
<ul>
<li><a href="#orgd07ba06">1.5.1. <span class="todo TODO">TODO</span> Live queries</a></li>
</ul>
</li>
<li><a href="#org55d6560">1.6. Supported Postgres types</a>
<ul>
<li><a href="#org8e8e09f">1.6.1. <span class="done DONE">DONE</span> Perform inserts on the <code>misc</code> table.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org083a33f">2. Remote Schema</a>
<ul>
<li><a href="#orge4a3f7a">2.1. Remote relationships</a>
<ul>
<li><a href="#org9b9d59c">2.1.1. <span class="todo TODO">TODO</span> To remote database</a></li>
<li><a href="#org3a69163">2.1.2. <span class="todo TODO">TODO</span> To Remote Schema&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOES_NOT_INVOLVE_DB">DOES_NOT_INVOLVE_DB</span></span></a></li>
</ul>
</li>
<li><a href="#org95a34b8">2.2. Authorization in remote schema</a>
<ul>
<li><a href="#org1a6191c">2.2.1. <span class="todo TODO">TODO</span> Forwarding auth context to/from remote schema&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOES_NOT_INVOLVE_DB">DOES_NOT_INVOLVE_DB</span></span></a></li>
<li><a href="#orgf491c9a">2.2.2. <span class="todo TODO">TODO</span> Remote schema permissions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOES_NOT_INVOLVE_DB">DOES_NOT_INVOLVE_DB</span></span></a></li>
<li><a href="#org8e42b60">2.2.3. <span class="todo TODO">TODO</span> Bypassing Hasura's auth for remote schema&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOES_NOT_INVOLVE_DB">DOES_NOT_INVOLVE_DB</span></span></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga2b1b87">3. Event Triggers</a>
<ul>
<li><a href="#orgbbc807d">3.1. Creating an Event Trigger</a>
<ul>
<li><a href="#org8540a07">3.1.1. <span class="done DONE">DONE</span> Create an insert trigger</a></li>
<li><a href="#orgc5bb305">3.1.2. <span class="done DONE">DONE</span> Create an update trigger</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org61ba29a">4. Scheduled Triggers</a>
<ul>
<li><a href="#orgca51f4a">4.1. Creating a chron trigger</a>
<ul>
<li><a href="#orgcc617ce">4.1.1. <span class="todo TODO">TODO</span> Create a chron trigger</a></li>
</ul>
</li>
<li><a href="#org77e5888">4.2. Creating a one-off scheduled event</a>
<ul>
<li><a href="#orgc7c9a7f">4.2.1. <span class="todo TODO">TODO</span> Create a one-off scheduled event</a></li>
</ul>
</li>
<li><a href="#orge19ebe4">4.3. Cleaning up scheduled triggers data</a>
<ul>
<li><a href="#org85067a3">4.3.1. <span class="todo TODO">TODO</span> Clear Everything</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org14de68b">5. Test Matrix</a>
<ul>
<li><a href="#orga571d6b">5.1. NOTES</a></li>
<li><a href="#orgf7342ba">5.2. Additional Notes</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org0f879b7" class="outline-2">
<h2 id="org0f879b7"><span class="section-number-2">1</span> Databases</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org42a567a" class="outline-3">
<h3 id="org42a567a"><span class="section-number-3">1.1</span> Postgres</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org39badf7" class="outline-3">
<h3 id="org39badf7"><span class="section-number-3">1.2</span> Schema</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgd282426" class="outline-4">
<h4 id="orgd282426"><span class="section-number-4">1.2.1</span> <span class="done DONE">DONE</span> Table Basics</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li class="on"><code>[X]</code> Add database</li>
<li class="on"><code>[X]</code> Add account and product tables</li>
<li class="on"><code>[X]</code> Add account and product data</li>
<li class="on"><code>[X]</code> Perform CRUD operations
<ul class="org-ul">
<li><p>
Read
</p>
<div class="org-src-container">
<pre class="src src-graphql">query MyQuery {
  account(order_by: {name: asc}, limit: 10) {
    id
    name
    created_at
    updated_at
  }
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-graphql">query MyQuery {
  product(order_by: {price: asc}, limit: 10) {
    id
    name
    price
    updated_at
    created_at
  }
}
</pre>
</div></li>
<li><p>
Insert
</p>
<div class="org-src-container">
<pre class="src src-graphql">mutation MyMutation {
  insert_account(objects: {name: "John Doe"}) {
    affected_rows
  }
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-graphql">mutation MyMutation {
  insert_product(objects: {name: "Doughnut", price: 100}) {
    returning {
      id
      name
      price
      updated_at
      created_at
    }
  }
}
</pre>
</div></li>
<li><p>
Update
</p>
<div class="org-src-container">
<pre class="src src-graphql">mutation MyMutation {
  update_account(where: {name: {_eq: "John Doe"}}, _set: {name: "Jane Doe"}) {
    affected_rows
  }
}
</pre>
</div></li>
<li><p>
Delete
</p>
<div class="org-src-container">
<pre class="src src-graphql">mutation MyMutation {
    delete_product(where: {name: {_eq: "Doughnut"}}) {
      affected_rows
    }
  }
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org3bd7f61" class="outline-4">
<h4 id="org3bd7f61"><span class="section-number-4">1.2.2</span> <span class="done DONE">DONE</span> Table Relationships</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li class="on"><code>[X]</code> Add the order and order detail tables</li>
<li class="on"><code>[X]</code> Add relationships for account, order, order detail, and product</li>
<li class="on"><code>[X]</code> Generate order and order detail data</li>
<li class="on"><code>[X]</code> <p>
Perform queries across relationships
</p>
<div class="org-src-container">
<pre class="src src-graphql">query MyQuery {
  account(limit: 2) {
    id
    name
    created_at
    updated_at
    orders {
      id
      created_at
      updated_at
      order_details {
	id
	created_at
	updated_at
	units
	product {
	  id
	  name
	  created_at
	  updated_at
	  price
	}
      }
    }
  }
}
</pre>
</div></li>
</ul>
</div>
</div>
