edb-test-1/README.tex
% Created 2022-09-02 Fri 15:34
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{David A. Ventimiglia}
\date{\textit{<2022-06-03 Fri>}}
\title{EDB Test Plan}
\hypersetup{
 pdfauthor={David A. Ventimiglia},
 pdftitle={EDB Test Plan},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.0.50 (Org mode 9.5.3)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Databases}
\label{sec:org50a7424}
\subsection{Postgres}
\label{sec:orga668f6e}
\subsection{Schema}
\label{sec:org9f7333d}
\subsubsection{{\bfseries\sffamily DONE} Table Basics}
\label{sec:org9ffa711}
\begin{itemize}
\item[{$\boxtimes$}] Add database
\item[{$\boxtimes$}] Add account and product tables
\item[{$\boxtimes$}] Add account and product data
\item[{$\boxtimes$}] Perform CRUD operations
\begin{itemize}
\item Read
\begin{verbatim}
query MyQuery {
  account(order_by: {name: asc}, limit: 10) {
    id
    name
    created_at
    updated_at
  }
}
\end{verbatim}
\begin{verbatim}
query MyQuery {
  product(order_by: {price: asc}, limit: 10) {
    id
    name
    price
    updated_at
    created_at
  }
}
\end{verbatim}
\item Insert
\begin{verbatim}
mutation MyMutation {
  insert_account(objects: {name: "John Doe"}) {
    affected_rows
  }
}
\end{verbatim}
\begin{verbatim}
mutation MyMutation {
  insert_product(objects: {name: "Doughnut", price: 100}) {
    returning {
      id
      name
      price
      updated_at
      created_at
    }
  }
}
\end{verbatim}
\item Update
\begin{verbatim}
mutation MyMutation {
  update_account(where: {name: {_eq: "John Doe"}}, _set: {name: "Jane Doe"}) {
    affected_rows
  }
}
\end{verbatim}
\item Delete
\begin{verbatim}
mutation MyMutation {
    delete_product(where: {name: {_eq: "Doughnut"}}) {
      affected_rows
    }
  }
\end{verbatim}
\end{itemize}
\end{itemize}
\subsubsection{{\bfseries\sffamily DONE} Table Relationships}
\label{sec:org1f19421}
\begin{itemize}
\item[{$\boxtimes$}] Add the order and order detail tables
\item[{$\boxtimes$}] Add relationships for account, order, order detail, and product
\item[{$\boxtimes$}] Generate order and order detail data
\item[{$\boxtimes$}] Perform queries across relationships
\begin{verbatim}
query MyQuery {
  account(limit: 2) {
    id
    name
    created_at
    updated_at
    orders {
      id
      created_at
      updated_at
      order_details {
	id
	created_at
	updated_at
	units
	product {
	  id
	  name
	  created_at
	  updated_at
	  price
	}
      }
    }
  }
}
\end{verbatim}
\end{itemize}
