edb-test-1/README.org
**** TODO Remote Relationships                       :DOES_NOT_INVOLVE_DB:
**** DONE Extend with Views
- [X] Add account_summary view and relationships
- [X] Query across table and view relationships
  #+begin_src graphql
    query MyQuery {
      account_summary(limit: 10) {
        id
        sum
        account {
          name
        }
      }
    }
  #+end_src
**** DONE Extend with SQL Functions
- [X] Add search functions
- [X] Query search functions
  #+begin_src graphql
    query MyQuery {
      product_search(args: {search: "apple"}) {
        name
        price
      }
    }
  #+end_src
  #+begin_src graphql
    query MyQuery {
      product_fuzzy_search(args: {search: "apple"}) {
        name
        price
      }
    }
  #+end_src
**** DONE Default field values
**** DONE Enum type fields
- [X] Create a native Postgres enum type for order status.
- [X] Create a enum table for region and track it as order sales_region.
**** DONE Computed fields
- [X] Add product_sku function and track it as a computed field
- [X] Query product table with computed field
#+begin_src graphql
  query {
    product(limit: 10) {
      id
      name
      price
      sku
    }
  }
#+end_src

**** DONE Customize auto-generated fields            :DOES_NOT_INVOLVE_DB:
- [X] Change order.status to order.state for the GraphQL field name
**** DONE Data validations
- [X] Add non_negative_price check constraint
- [X] Attempt mutations with and without negative prices
  #+begin_src graphql
    mutation MyMutation {
      update_product(where: {name: {_eq: "Chilli Paste, Sambal Oelek"}}, _set: {price: 10}) {
        affected_rows
      }
    }
  #+end_src
  #+begin_src graphql
    mutation MyMutation {
      update_product(where: {name: {_eq: "Pastry - Raisin Muffin - Mini"}}, _set: {price: -10}) {
        affected_rows
      }
    }
  #+end_src
**** DONE Using an existing database
**** DONE Relay Schema                               :DOES_NOT_INVOLVE_DB:
- [X] Turn on the Relay API in the Console
#+begin_src graphql
  query MyQuery {
    account_connection(first: 10) {
      edges {
        node {
          name
          orders {
            id
            region
            order_details {
              units
              product {
                name
                price
                sku
              }
            }
          }
        }
        cursor
      }
    }
  }
#+end_src
*** Queries
**** DONE Simple object queries
**** DONE Nested object queries
**** DONE Aggregation queries
#+begin_src graphql
  query MyQuery {
    account_aggregate {
      aggregate {
        count
      }
    }
  }
#+end_src
#+begin_src graphql
  query MyQuery {
    account(limit: 10) {
      orders {
        order_details_aggregate {
          aggregate {
            sum {
              units
            }
          }
        }
      }
    }
  }
#+end_src
**** DONE Filter query results / search queries
**** DONE Sort query results
**** DONE Distinct query results
**** TODO Using multiple arguments                   :DOES_NOT_INVOLVE_DB:
**** TODO Multiple queries in a request              :DOES_NOT_INVOLVE_DB:
**** TODO Using variables / aliases / fragments / directives :DOES_NOT_INVOLVE_DB:
**** TODO Query performance
*** Mutations
**** DONE Insert
**** TODO Upsert
**** DONE Update
**** TODO Delete
