edb-test-1/README.html
<div id="outline-container-orgaa1462d" class="outline-4">
<h4 id="orgaa1462d"><span class="section-number-4">1.2.3</span> <span class="todo TODO">TODO</span> Remote Relationships&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOES_NOT_INVOLVE_DB">DOES_NOT_INVOLVE_DB</span></span></h4>
</div>
<div id="outline-container-orgbe36160" class="outline-4">
<h4 id="orgbe36160"><span class="section-number-4">1.2.4</span> <span class="done DONE">DONE</span> Extend with Views</h4>
<div class="outline-text-4" id="text-1-2-4">
<ul class="org-ul">
<li class="on"><code>[X]</code> Add account<sub>summary</sub> view and relationships</li>
<li class="on"><code>[X]</code> <p>
Query across table and view relationships
</p>
<div class="org-src-container">
<pre class="src src-graphql">query MyQuery {
  account_summary(limit: 10) {
    id
    sum
    account {
      name
    }
  }
}
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org600a17d" class="outline-4">
<h4 id="org600a17d"><span class="section-number-4">1.2.5</span> <span class="done DONE">DONE</span> Extend with SQL Functions</h4>
<div class="outline-text-4" id="text-1-2-5">
<ul class="org-ul">
<li class="on"><code>[X]</code> Add search functions</li>
<li class="on"><code>[X]</code> <p>
Query search functions
</p>
<div class="org-src-container">
<pre class="src src-graphql">query MyQuery {
  product_search(args: {search: "apple"}) {
    name
    price
  }
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-graphql">query MyQuery {
  product_fuzzy_search(args: {search: "apple"}) {
    name
    price
  }
}
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org6ad4c4b" class="outline-4">
<h4 id="org6ad4c4b"><span class="section-number-4">1.2.6</span> <span class="done DONE">DONE</span> Default field values</h4>
</div>
<div id="outline-container-orgc9bf8b2" class="outline-4">
<h4 id="orgc9bf8b2"><span class="section-number-4">1.2.7</span> <span class="done DONE">DONE</span> Enum type fields</h4>
<div class="outline-text-4" id="text-1-2-7">
<ul class="org-ul">
<li class="on"><code>[X]</code> Create a native Postgres enum type for order status.</li>
<li class="on"><code>[X]</code> Create a enum table for region and track it as order sales<sub>region</sub>.</li>
</ul>
</div>
</div>
<div id="outline-container-org1e4cc51" class="outline-4">
<h4 id="org1e4cc51"><span class="section-number-4">1.2.8</span> <span class="done DONE">DONE</span> Computed fields</h4>
<div class="outline-text-4" id="text-1-2-8">
<ul class="org-ul">
<li class="on"><code>[X]</code> Add product<sub>sku</sub> function and track it as a computed field</li>
<li class="on"><code>[X]</code> Query product table with computed field</li>
</ul>
<div class="org-src-container">
<pre class="src src-graphql">query {
  product(limit: 10) {
    id
    name
    price
    sku
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaa6ae38" class="outline-4">
<h4 id="orgaa6ae38"><span class="section-number-4">1.2.9</span> <span class="done DONE">DONE</span> Customize auto-generated fields&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOES_NOT_INVOLVE_DB">DOES_NOT_INVOLVE_DB</span></span></h4>
<div class="outline-text-4" id="text-1-2-9">
<ul class="org-ul">
<li class="on"><code>[X]</code> Change order.status to order.state for the GraphQL field name</li>
</ul>
</div>
</div>
<div id="outline-container-org94d0c5b" class="outline-4">
<h4 id="org94d0c5b"><span class="section-number-4">1.2.10</span> <span class="done DONE">DONE</span> Data validations</h4>
<div class="outline-text-4" id="text-1-2-10">
<ul class="org-ul">
<li class="on"><code>[X]</code> Add non<sub>negative</sub><sub>price</sub> check constraint</li>
<li class="on"><code>[X]</code> <p>
Attempt mutations with and without negative prices
</p>
<div class="org-src-container">
<pre class="src src-graphql">mutation MyMutation {
  update_product(where: {name: {_eq: "Chilli Paste, Sambal Oelek"}}, _set: {price: 10}) {
    affected_rows
  }
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-graphql">mutation MyMutation {
  update_product(where: {name: {_eq: "Pastry - Raisin Muffin - Mini"}}, _set: {price: -10}) {
    affected_rows
  }
}
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-orgf89ca92" class="outline-4">
<h4 id="orgf89ca92"><span class="section-number-4">1.2.11</span> <span class="done DONE">DONE</span> Using an existing database</h4>
</div>
<div id="outline-container-org8670011" class="outline-4">
<h4 id="org8670011"><span class="section-number-4">1.2.12</span> <span class="done DONE">DONE</span> Relay Schema&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOES_NOT_INVOLVE_DB">DOES_NOT_INVOLVE_DB</span></span></h4>
<div class="outline-text-4" id="text-1-2-12">
<ul class="org-ul">
<li class="on"><code>[X]</code> Turn on the Relay API in the Console</li>
</ul>
<div class="org-src-container">
<pre class="src src-graphql">query MyQuery {
  account_connection(first: 10) {
    edges {
      node {
	name
	orders {
	  id
	  region
	  order_details {
	    units
	    product {
	      name
	      price
	      sku
	    }
	  }
	}
      }
      cursor
    }
  }
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org5ca6940" class="outline-3">
<h3 id="org5ca6940"><span class="section-number-3">1.3</span> Queries</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orgb888a2f" class="outline-4">
<h4 id="orgb888a2f"><span class="section-number-4">1.3.1</span> <span class="done DONE">DONE</span> Simple object queries</h4>
</div>
<div id="outline-container-orgafbe33c" class="outline-4">
<h4 id="orgafbe33c"><span class="section-number-4">1.3.2</span> <span class="done DONE">DONE</span> Nested object queries</h4>
</div>
<div id="outline-container-orgc9ef7f0" class="outline-4">
<h4 id="orgc9ef7f0"><span class="section-number-4">1.3.3</span> <span class="done DONE">DONE</span> Aggregation queries</h4>
<div class="outline-text-4" id="text-1-3-3">
<div class="org-src-container">
<pre class="src src-graphql">query MyQuery {
  account_aggregate {
    aggregate {
      count
    }
  }
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-graphql">query MyQuery {
  account(limit: 10) {
    orders {
      order_details_aggregate {
	aggregate {
	  sum {
	    units
	  }
	}
      }
    }
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org4104d9b" class="outline-4">
<h4 id="org4104d9b"><span class="section-number-4">1.3.4</span> <span class="done DONE">DONE</span> Filter query results / search queries</h4>
</div>
<div id="outline-container-org457feea" class="outline-4">
<h4 id="org457feea"><span class="section-number-4">1.3.5</span> <span class="done DONE">DONE</span> Sort query results</h4>
</div>
<div id="outline-container-org2e05c88" class="outline-4">
<h4 id="org2e05c88"><span class="section-number-4">1.3.6</span> <span class="done DONE">DONE</span> Distinct query results</h4>
</div>
<div id="outline-container-org174fd8c" class="outline-4">
<h4 id="org174fd8c"><span class="section-number-4">1.3.7</span> <span class="todo TODO">TODO</span> Using multiple arguments&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOES_NOT_INVOLVE_DB">DOES_NOT_INVOLVE_DB</span></span></h4>
</div>
<div id="outline-container-orgab3a3e2" class="outline-4">
<h4 id="orgab3a3e2"><span class="section-number-4">1.3.8</span> <span class="todo TODO">TODO</span> Multiple queries in a request&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOES_NOT_INVOLVE_DB">DOES_NOT_INVOLVE_DB</span></span></h4>
</div>
<div id="outline-container-orgd058a4c" class="outline-4">
<h4 id="orgd058a4c"><span class="section-number-4">1.3.9</span> <span class="todo TODO">TODO</span> Using variables / aliases / fragments / directives&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOES_NOT_INVOLVE_DB">DOES_NOT_INVOLVE_DB</span></span></h4>
</div>
<div id="outline-container-org16a9ab9" class="outline-4">
<h4 id="org16a9ab9"><span class="section-number-4">1.3.10</span> <span class="todo TODO">TODO</span> Query performance</h4>
</div>
</div>
