edb-test-1/README.tex
\subsubsection{{\bfseries\sffamily TODO} Remote Relationships\hfill{}\textsc{DOES\_NOT\_INVOLVE\_DB}}
\label{sec:orgb914b56}
\subsubsection{{\bfseries\sffamily DONE} Extend with Views}
\label{sec:orgef71ec1}
\begin{itemize}
\item[{$\boxtimes$}] Add account\textsubscript{summary} view and relationships
\item[{$\boxtimes$}] Query across table and view relationships
\begin{verbatim}
query MyQuery {
  account_summary(limit: 10) {
    id
    sum
    account {
      name
    }
  }
}
\end{verbatim}
\end{itemize}
\subsubsection{{\bfseries\sffamily DONE} Extend with SQL Functions}
\label{sec:org9c083e4}
\begin{itemize}
\item[{$\boxtimes$}] Add search functions
\item[{$\boxtimes$}] Query search functions
\begin{verbatim}
query MyQuery {
  product_search(args: {search: "apple"}) {
    name
    price
  }
}
\end{verbatim}
\begin{verbatim}
query MyQuery {
  product_fuzzy_search(args: {search: "apple"}) {
    name
    price
  }
}
\end{verbatim}
\end{itemize}
\subsubsection{{\bfseries\sffamily DONE} Default field values}
\label{sec:orgd510066}
\subsubsection{{\bfseries\sffamily DONE} Enum type fields}
\label{sec:org90f5db2}
\begin{itemize}
\item[{$\boxtimes$}] Create a native Postgres enum type for order status.
\item[{$\boxtimes$}] Create a enum table for region and track it as order sales\textsubscript{region}.
\end{itemize}
\subsubsection{{\bfseries\sffamily DONE} Computed fields}
\label{sec:org22a62b4}
\begin{itemize}
\item[{$\boxtimes$}] Add product\textsubscript{sku} function and track it as a computed field
\item[{$\boxtimes$}] Query product table with computed field
\end{itemize}
\begin{verbatim}
query {
  product(limit: 10) {
    id
    name
    price
    sku
  }
}
\end{verbatim}

\subsubsection{{\bfseries\sffamily DONE} Customize auto-generated fields\hfill{}\textsc{DOES\_NOT\_INVOLVE\_DB}}
\label{sec:org86be622}
\begin{itemize}
\item[{$\boxtimes$}] Change order.status to order.state for the GraphQL field name
\end{itemize}
\subsubsection{{\bfseries\sffamily DONE} Data validations}
\label{sec:orga58dd10}
\begin{itemize}
\item[{$\boxtimes$}] Add non\textsubscript{negative}\textsubscript{price} check constraint
\item[{$\boxtimes$}] Attempt mutations with and without negative prices
\begin{verbatim}
mutation MyMutation {
  update_product(where: {name: {_eq: "Chilli Paste, Sambal Oelek"}}, _set: {price: 10}) {
    affected_rows
  }
}
\end{verbatim}
\begin{verbatim}
mutation MyMutation {
  update_product(where: {name: {_eq: "Pastry - Raisin Muffin - Mini"}}, _set: {price: -10}) {
    affected_rows
  }
}
\end{verbatim}
\end{itemize}
\subsubsection{{\bfseries\sffamily DONE} Using an existing database}
\label{sec:orgd182bfd}
\subsubsection{{\bfseries\sffamily DONE} Relay Schema\hfill{}\textsc{DOES\_NOT\_INVOLVE\_DB}}
\label{sec:org5ff57c6}
\begin{itemize}
\item[{$\boxtimes$}] Turn on the Relay API in the Console
\end{itemize}
\begin{verbatim}
query MyQuery {
  account_connection(first: 10) {
    edges {
      node {
	name
	orders {
	  id
	  region
	  order_details {
	    units
	    product {
	      name
	      price
	      sku
	    }
	  }
	}
      }
      cursor
    }
  }
}
\end{verbatim}
\subsection{Queries}
\label{sec:org929a1b4}
\subsubsection{{\bfseries\sffamily DONE} Simple object queries}
\label{sec:org7b63330}
\subsubsection{{\bfseries\sffamily DONE} Nested object queries}
\label{sec:org277b4c7}
\subsubsection{{\bfseries\sffamily DONE} Aggregation queries}
\label{sec:org6ce5b11}
\begin{verbatim}
query MyQuery {
  account_aggregate {
    aggregate {
      count
    }
  }
}
\end{verbatim}
\begin{verbatim}
query MyQuery {
  account(limit: 10) {
    orders {
      order_details_aggregate {
	aggregate {
	  sum {
	    units
	  }
	}
      }
    }
  }
}
\end{verbatim}
\subsubsection{{\bfseries\sffamily DONE} Filter query results / search queries}
\label{sec:org11a8848}
\subsubsection{{\bfseries\sffamily DONE} Sort query results}
\label{sec:orgf9c1f2d}
\subsubsection{{\bfseries\sffamily DONE} Distinct query results}
\label{sec:org95051f6}
\subsubsection{{\bfseries\sffamily TODO} Using multiple arguments\hfill{}\textsc{DOES\_NOT\_INVOLVE\_DB}}
\label{sec:org8349c71}
\subsubsection{{\bfseries\sffamily TODO} Multiple queries in a request\hfill{}\textsc{DOES\_NOT\_INVOLVE\_DB}}
\label{sec:org52cb7e6}
\subsubsection{{\bfseries\sffamily TODO} Using variables / aliases / fragments / directives\hfill{}\textsc{DOES\_NOT\_INVOLVE\_DB}}
\label{sec:org1813577}
\subsubsection{{\bfseries\sffamily TODO} Query performance}
\label{sec:orgc8f6310}
