edb-test-1/README.org
**** TODO Multiple mutations in a request
*** Subscriptions
**** TODO Live queries
*** Supported Postgres types
***** DONE Perform inserts on the ~misc~ table.
#+begin_src graphql
  mutation {
    insert_misc(objects: [
        {
          bigint_field: 1
          bigserial_field: 1
          boolean_field: true
          box_field: "((0,0),(1,1))"
          bytea_field: "\\xDEADBEEF"
          character_field: "foo"
          character_varying_field: "bar"
          cidr_field: "192.168.100.128/25"
          circle_field: "0,0,1"
          date_field: "2022-01-01"
          double_precision_field: 9673143120,
          inet_field: "192.168.0.1/24"
          integer_field: 1
          interval_field: "'1 month ago'"
          json_field: {}
          jsonb_field: {}
          line_field: "0,0,1,1"
          lseg_field: "0,0,1,1"
          macaddr_field: "08:00:2b:01:02:03"
          macaddr8_field: "08:00:2b:01:02:03:04:05"
          money_field: 52093.89
          numeric_field: 10
          path_field: "0,0,1,1,2,2,3,3,3,0,2,0,0,0"
          pg_lsn_field: "FFFFFFFF/FFFFFFFF"
          point_field: "0,0"
          polygon_field: "0,0,1,0,1,1,0,1"
          real_field: 3.14159
          serial_field: 1
          smallint_field: 1
          smallserial_field: 1
          text_field: "abc"
          time_with_time_zone_field: "04:05:06 PST"
          time_without_time_zone_field: "04:05:06"
          timestamp_with_time_zone_field: "2022-01-01 04:05:06 PST"
          timestamp_without_time_zone_field: "2022-01-01 04:05:06"
          txid_snapshot_field: "566:566:"
          uuid_field: "61a41be6-4eb4-45a5-bfb5-b68c20e9ccde"
          xml_field: "<?xml version=\"1.0\"?><book><title>Manual</title><chapter>...</chapter></book>"
        }
      ]) {
      returning {
        bigint_field
        bigserial_field
        boolean_field
        box_field
        bytea_field
        character_field
        character_varying_field
        cidr_field
        circle_field
        date_field
        double_precision_field
        inet_field
        integer_field
        interval_field
        json_field
        jsonb_field
        line_field
        lseg_field
        macaddr_field
        macaddr8_field
        money_field
        numeric_field
        path_field
        pg_lsn_field
        point_field
        polygon_field
        real_field
        serial_field
        smallint_field
        smallserial_field
        text_field
        time_with_time_zone_field
        time_without_time_zone_field
        timestamp_with_time_zone_field
        timestamp_without_time_zone_field
        txid_snapshot_field
        uuid_field
        xml_field
      }
    }
  }
#+end_src

* Remote Schema
*** Remote relationships
***** TODO To remote database
***** TODO To Remote Schema                         :DOES_NOT_INVOLVE_DB:
*** Authorization in remote schema
***** TODO Forwarding auth context to/from remote schema :DOES_NOT_INVOLVE_DB:
***** TODO Remote schema permissions                :DOES_NOT_INVOLVE_DB:
***** TODO Bypassing Hasura's auth for remote schema :DOES_NOT_INVOLVE_DB:
* Event Triggers
*** Creating an Event Trigger
***** DONE Create an insert trigger
***** DONE Create an update trigger
- [ ] Perform a mutation to update an order
- [ ] Update an order from the Console
#+begin_src graphql
  mutation MyMutation {
    update_order_by_pk(pk_columns: {id: "1564344e-e528-43de-b88e-dab9c3efa44e"}, _set: {state: "fulfilled"}) {
      id
      state
    }
  }
#+end_src
- [ ] Check the events logs
* Scheduled Triggers
*** Creating a chron trigger
