edb-test-1/README.html
<div id="outline-container-orgfc24c1e" class="outline-3">
<h3 id="orgfc24c1e"><span class="section-number-3">1.4</span> Mutations</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-orga73c3bd" class="outline-4">
<h4 id="orga73c3bd"><span class="section-number-4">1.4.1</span> <span class="done DONE">DONE</span> Insert</h4>
</div>
<div id="outline-container-org38d9b7e" class="outline-4">
<h4 id="org38d9b7e"><span class="section-number-4">1.4.2</span> <span class="todo TODO">TODO</span> Upsert</h4>
</div>
<div id="outline-container-orgf636ae9" class="outline-4">
<h4 id="orgf636ae9"><span class="section-number-4">1.4.3</span> <span class="done DONE">DONE</span> Update</h4>
</div>
<div id="outline-container-org46dcbc3" class="outline-4">
<h4 id="org46dcbc3"><span class="section-number-4">1.4.4</span> <span class="todo TODO">TODO</span> Delete</h4>
</div>
<div id="outline-container-orga6285c5" class="outline-4">
<h4 id="orga6285c5"><span class="section-number-4">1.4.5</span> <span class="todo TODO">TODO</span> Multiple mutations in a request</h4>
</div>
</div>
<div id="outline-container-orge222e0f" class="outline-3">
<h3 id="orge222e0f"><span class="section-number-3">1.5</span> Subscriptions</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-orgd07ba06" class="outline-4">
<h4 id="orgd07ba06"><span class="section-number-4">1.5.1</span> <span class="todo TODO">TODO</span> Live queries</h4>
</div>
</div>
<div id="outline-container-org55d6560" class="outline-3">
<h3 id="org55d6560"><span class="section-number-3">1.6</span> Supported Postgres types</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-org8e8e09f" class="outline-4">
<h4 id="org8e8e09f"><span class="section-number-4">1.6.1</span> <span class="done DONE">DONE</span> Perform inserts on the <code>misc</code> table.</h4>
<div class="outline-text-4" id="text-1-6-1">
<div class="org-src-container">
<pre class="src src-graphql">mutation {
  insert_misc(objects: [
      {
	bigint_field: 1
	bigserial_field: 1
	boolean_field: true
	box_field: "((0,0),(1,1))"
	bytea_field: "\\xDEADBEEF"
	character_field: "foo"
	character_varying_field: "bar"
	cidr_field: "192.168.100.128/25"
	circle_field: "0,0,1"
	date_field: "2022-01-01"
	double_precision_field: 9673143120,
	inet_field: "192.168.0.1/24"
	integer_field: 1
	interval_field: "'1 month ago'"
	json_field: {}
	jsonb_field: {}
	line_field: "0,0,1,1"
	lseg_field: "0,0,1,1"
	macaddr_field: "08:00:2b:01:02:03"
	macaddr8_field: "08:00:2b:01:02:03:04:05"
	money_field: 52093.89
	numeric_field: 10
	path_field: "0,0,1,1,2,2,3,3,3,0,2,0,0,0"
	pg_lsn_field: "FFFFFFFF/FFFFFFFF"
	point_field: "0,0"
	polygon_field: "0,0,1,0,1,1,0,1"
	real_field: 3.14159
	serial_field: 1
	smallint_field: 1
	smallserial_field: 1
	text_field: "abc"
	time_with_time_zone_field: "04:05:06 PST"
	time_without_time_zone_field: "04:05:06"
	timestamp_with_time_zone_field: "2022-01-01 04:05:06 PST"
	timestamp_without_time_zone_field: "2022-01-01 04:05:06"
	txid_snapshot_field: "566:566:"
	uuid_field: "61a41be6-4eb4-45a5-bfb5-b68c20e9ccde"
	xml_field: "&lt;?xml version=\"1.0\"?&gt;&lt;book&gt;&lt;title&gt;Manual&lt;/title&gt;&lt;chapter&gt;...&lt;/chapter&gt;&lt;/book&gt;"
      }
    ]) {
    returning {
      bigint_field
      bigserial_field
      boolean_field
      box_field
      bytea_field
      character_field
      character_varying_field
      cidr_field
      circle_field
      date_field
      double_precision_field
      inet_field
      integer_field
      interval_field
      json_field
      jsonb_field
      line_field
      lseg_field
      macaddr_field
      macaddr8_field
      money_field
      numeric_field
      path_field
      pg_lsn_field
      point_field
      polygon_field
      real_field
      serial_field
      smallint_field
      smallserial_field
      text_field
      time_with_time_zone_field
      time_without_time_zone_field
      timestamp_with_time_zone_field
      timestamp_without_time_zone_field
      txid_snapshot_field
      uuid_field
      xml_field
    }
  }
}
</pre>
</div>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org083a33f" class="outline-2">
<h2 id="org083a33f"><span class="section-number-2">2</span> Remote Schema</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orge4a3f7a" class="outline-3">
<h3 id="orge4a3f7a"><span class="section-number-3">2.1</span> Remote relationships</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org9b9d59c" class="outline-4">
<h4 id="org9b9d59c"><span class="section-number-4">2.1.1</span> <span class="todo TODO">TODO</span> To remote database</h4>
</div>
<div id="outline-container-org3a69163" class="outline-4">
<h4 id="org3a69163"><span class="section-number-4">2.1.2</span> <span class="todo TODO">TODO</span> To Remote Schema&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOES_NOT_INVOLVE_DB">DOES_NOT_INVOLVE_DB</span></span></h4>
</div>
</div>
<div id="outline-container-org95a34b8" class="outline-3">
<h3 id="org95a34b8"><span class="section-number-3">2.2</span> Authorization in remote schema</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org1a6191c" class="outline-4">
<h4 id="org1a6191c"><span class="section-number-4">2.2.1</span> <span class="todo TODO">TODO</span> Forwarding auth context to/from remote schema&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOES_NOT_INVOLVE_DB">DOES_NOT_INVOLVE_DB</span></span></h4>
</div>
<div id="outline-container-orgf491c9a" class="outline-4">
<h4 id="orgf491c9a"><span class="section-number-4">2.2.2</span> <span class="todo TODO">TODO</span> Remote schema permissions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOES_NOT_INVOLVE_DB">DOES_NOT_INVOLVE_DB</span></span></h4>
</div>
<div id="outline-container-org8e42b60" class="outline-4">
<h4 id="org8e42b60"><span class="section-number-4">2.2.3</span> <span class="todo TODO">TODO</span> Bypassing Hasura's auth for remote schema&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOES_NOT_INVOLVE_DB">DOES_NOT_INVOLVE_DB</span></span></h4>
</div>
</div>
</div>
<div id="outline-container-orga2b1b87" class="outline-2">
<h2 id="orga2b1b87"><span class="section-number-2">3</span> Event Triggers</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgbbc807d" class="outline-3">
<h3 id="orgbbc807d"><span class="section-number-3">3.1</span> Creating an Event Trigger</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org8540a07" class="outline-4">
<h4 id="org8540a07"><span class="section-number-4">3.1.1</span> <span class="done DONE">DONE</span> Create an insert trigger</h4>
</div>
<div id="outline-container-orgc5bb305" class="outline-4">
<h4 id="orgc5bb305"><span class="section-number-4">3.1.2</span> <span class="done DONE">DONE</span> Create an update trigger</h4>
<div class="outline-text-4" id="text-3-1-2">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Perform a mutation to update an order</li>
<li class="off"><code>[&#xa0;]</code> Update an order from the Console</li>
</ul>
<div class="org-src-container">
<pre class="src src-graphql">mutation MyMutation {
  update_order_by_pk(pk_columns: {id: "1564344e-e528-43de-b88e-dab9c3efa44e"}, _set: {state: "fulfilled"}) {
    id
    state
  }
}
</pre>
</div>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Check the events logs</li>
</ul>
</div>
</div>
</div>
</div>
