edb-test-1/README.org
***** TODO Create a chron trigger
- [ ] Allow time to pass
- [ ] Check the events logs
*** Creating a one-off scheduled event
***** TODO Create a one-off scheduled event
*** Cleaning up scheduled triggers data
***** TODO Clear Everything
- [ ] Cron triggers

  #+begin_src sql
  DELETE FROM hdb_catalog.hdb_cron_events;
  #+end_src

- [ ] Scheduled events

  #+begin_src sql
  DELETE FROM hdb_catalog.hdb_scheduled_events;
  #+end_src
