edb-test-1/README.html
<div id="outline-container-org61ba29a" class="outline-2">
<h2 id="org61ba29a"><span class="section-number-2">4</span> Scheduled Triggers</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgca51f4a" class="outline-3">
<h3 id="orgca51f4a"><span class="section-number-3">4.1</span> Creating a chron trigger</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-orgcc617ce" class="outline-4">
<h4 id="orgcc617ce"><span class="section-number-4">4.1.1</span> <span class="todo TODO">TODO</span> Create a chron trigger</h4>
<div class="outline-text-4" id="text-4-1-1">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Allow time to pass</li>
<li class="off"><code>[&#xa0;]</code> Check the events logs</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org77e5888" class="outline-3">
<h3 id="org77e5888"><span class="section-number-3">4.2</span> Creating a one-off scheduled event</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-orgc7c9a7f" class="outline-4">
<h4 id="orgc7c9a7f"><span class="section-number-4">4.2.1</span> <span class="todo TODO">TODO</span> Create a one-off scheduled event</h4>
</div>
</div>
<div id="outline-container-orge19ebe4" class="outline-3">
<h3 id="orge19ebe4"><span class="section-number-3">4.3</span> Cleaning up scheduled triggers data</h3>
<div class="outline-text-3" id="text-4-3">
</div>
<div id="outline-container-org85067a3" class="outline-4">
<h4 id="org85067a3"><span class="section-number-4">4.3.1</span> <span class="todo TODO">TODO</span> Clear Everything</h4>
<div class="outline-text-4" id="text-4-3-1">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <p>
Cron triggers
</p>

<div class="org-src-container">
<pre class="src src-sql">DELETE FROM hdb_catalog.hdb_cron_events;
</pre>
</div></li>

<li class="off"><code>[&#xa0;]</code> <p>
Scheduled events
</p>

<div class="org-src-container">
<pre class="src src-sql">DELETE FROM hdb_catalog.hdb_scheduled_events;
</pre>
</div></li>
</ul>
</div>
</div>
</div>
</div>
