edb-test-1/README.tex
\section{Scheduled Triggers}
\label{sec:org17a6475}
\subsection{Creating a chron trigger}
\label{sec:org5c5314e}
\subsubsection{{\bfseries\sffamily TODO} Create a chron trigger}
\label{sec:org501cf47}
\begin{itemize}
\item[{$\square$}] Allow time to pass
\item[{$\square$}] Check the events logs
\end{itemize}
\subsection{Creating a one-off scheduled event}
\label{sec:orgff70621}
\subsubsection{{\bfseries\sffamily TODO} Create a one-off scheduled event}
\label{sec:org67b05c9}
\subsection{Cleaning up scheduled triggers data}
\label{sec:org180ea80}
\subsubsection{{\bfseries\sffamily TODO} Clear Everything}
\label{sec:orgef0e673}
\begin{itemize}
\item[{$\square$}] Cron triggers

\begin{verbatim}
DELETE FROM hdb_catalog.hdb_cron_events;
\end{verbatim}

\item[{$\square$}] Scheduled events

\begin{verbatim}
DELETE FROM hdb_catalog.hdb_scheduled_events;
\end{verbatim}
\end{itemize}
