edb-test-1/README.html
<div id="outline-container-org14de68b" class="outline-2">
<h2 id="org14de68b"><span class="section-number-2">5</span> Test Matrix</h2>
<div class="outline-text-2" id="text-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Test</th>
<th scope="col" class="org-left">Outcome</th>
<th scope="col" class="org-left">Comments</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Remote Relationships</td>
<td class="org-left">NO</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Remote Schema connect to GraphQL servers</td>
</tr>

<tr>
<td class="org-left">Add Database</td>
<td class="org-left">YES</td>
<td class="org-left">SUCCESS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Add tables and relationships in Console</td>
<td class="org-left">YES</td>
<td class="org-left">SUCCESS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Perform CRUD operations in API</td>
<td class="org-left">YES</td>
<td class="org-left">SUCCESS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Set up and use table relationships</td>
<td class="org-left">YES</td>
<td class="org-left">SUCCESS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Track views</td>
<td class="org-left">YES</td>
<td class="org-left">SUCCESS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Manually add relationships to views</td>
<td class="org-left">YES</td>
<td class="org-left">SUCCESS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Query across view/table relationships</td>
<td class="org-left">YES</td>
<td class="org-left">SUCCESS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Track a function as a table and use</td>
<td class="org-left">YES</td>
<td class="org-left">SUCCESS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Track a function as a computed field and use</td>
<td class="org-left">YES</td>
<td class="org-left">SUCCESS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Use defaults for field values</td>
<td class="org-left">YES</td>
<td class="org-left">SUCCESS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Use a native enum as a Hasura enum</td>
<td class="org-left">YES</td>
<td class="org-left">SUCCESS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Use a table as a Hasura enum</td>
<td class="org-left">YES</td>
<td class="org-left">SUCCESS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Customize field-names in API</td>
<td class="org-left">YES</td>
<td class="org-left">SUCCESS</td>
<td class="org-left">Doesn't actually involve the DB</td>
</tr>

<tr>
<td class="org-left">Data validation with a database constraint</td>
<td class="org-left">YES</td>
<td class="org-left">SUCCESS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Test using the Relay API</td>
<td class="org-left">YES</td>
<td class="org-left">SUCCESS</td>
<td class="org-left">Doesn't actually involve the DB</td>
</tr>

<tr>
<td class="org-left">Simple object queries</td>
<td class="org-left">YES</td>
<td class="org-left">SUCCESS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Nested object queries (involves JOINs)</td>
<td class="org-left">YES</td>
<td class="org-left">SUCCESS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Aggregation queries (count)</td>
<td class="org-left">YES</td>
<td class="org-left">SUCCESS</td>
<td class="org-left">We didn't test min, max, avg, etc.</td>
</tr>

<tr>
<td class="org-left">Filter queries (involves WHERE)</td>
<td class="org-left">YES</td>
<td class="org-left">SUCCESS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Sort queries (involves ORDER BY)</td>
<td class="org-left">YES</td>
<td class="org-left">SUCCESS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Distinct queries (involves DISTINCT)</td>
<td class="org-left">YES</td>
<td class="org-left">SUCCESS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Limit queries (involves LIMIT)</td>
<td class="org-left">YES</td>
<td class="org-left">SUCCESS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Using multiple arguments</td>
<td class="org-left">NO</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Doesn't actually involve the DB</td>
</tr>

<tr>
<td class="org-left">Multiple queries in a request</td>
<td class="org-left">NO</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Doesn't actually involve the DB</td>
</tr>

<tr>
<td class="org-left">Multiple variables / aliases / fragments / directives</td>
<td class="org-left">NO</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Doesn't actually involve the DB</td>
</tr>

<tr>
<td class="org-left">INSERT (see "Perform CRUD operations in API" above</td>
<td class="org-left">YES</td>
<td class="org-left">SUCCESS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">UPDATE (see "Perform CRUD operations in API" above</td>
<td class="org-left">YES</td>
<td class="org-left">SUCCESS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">DELETE (see "Perform CRUD operations in API" above</td>
<td class="org-left">TBD</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">We forgot to test this!</td>
</tr>

<tr>
<td class="org-left">ON CONFLICT (an "upsert")</td>
<td class="org-left">TBD</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">We forgot to test this!</td>
</tr>

<tr>
<td class="org-left">Multiple mutations in a request</td>
<td class="org-left">TBD</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">We forgot to test this!</td>
</tr>

<tr>
<td class="org-left">Subscriptions (Live Queries)</td>
<td class="org-left">TBD</td>
<td class="org-left">SUCCESS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Test all Postgres/Hasura types (mutation, query)</td>
<td class="org-left">TBD</td>
<td class="org-left">SUCCESS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Remote Database</td>
<td class="org-left">TBD</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">We forgot to test this!</td>
</tr>

<tr>
<td class="org-left">Creating event triggers</td>
<td class="org-left">YES</td>
<td class="org-left">FAIL</td>
<td class="org-left">Needs a Hasura fix. See Notes below</td>
</tr>

<tr>
<td class="org-left">Creating a chron trigger</td>
<td class="org-left">TBD</td>
<td class="org-left">FAIL</td>
<td class="org-left">Needs a Hasura fix. See Notes below</td>
</tr>

<tr>
<td class="org-left">Creating a one-off scheduled event</td>
<td class="org-left">TBD</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Needs a Hasura fix</td>
</tr>

<tr>
<td class="org-left">Cleaning up scheduled trigger data</td>
<td class="org-left">TBD</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Needs a Hasura fix</td>
</tr>

<tr>
<td class="org-left">CI/CD: hasura metadata (apply, clear, reload, status)</td>
<td class="org-left">YES</td>
<td class="org-left">SUCCESS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CI/CD: hasura migrate (apply, apply &#x2013;down all, delete)</td>
<td class="org-left">YES</td>
<td class="org-left">SUCCESS</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
