edb-test-1/README.tex
\section{Test Matrix}
\label{sec:org66841b0}
\begin{center}
\begin{tabular}{llll}
\hline
Function & Test & Outcome & Comments\\
\hline
Remote Relationships & NO &  & Remote Schema connect to GraphQL servers\\
Add Database & YES & SUCCESS & \\
Add tables and relationships in Console & YES & SUCCESS & \\
Perform CRUD operations in API & YES & SUCCESS & \\
Set up and use table relationships & YES & SUCCESS & \\
Track views & YES & SUCCESS & \\
Manually add relationships to views & YES & SUCCESS & \\
Query across view/table relationships & YES & SUCCESS & \\
Track a function as a table and use & YES & SUCCESS & \\
Track a function as a computed field and use & YES & SUCCESS & \\
Use defaults for field values & YES & SUCCESS & \\
Use a native enum as a Hasura enum & YES & SUCCESS & \\
Use a table as a Hasura enum & YES & SUCCESS & \\
Customize field-names in API & YES & SUCCESS & Doesn't actually involve the DB\\
Data validation with a database constraint & YES & SUCCESS & \\
Test using the Relay API & YES & SUCCESS & Doesn't actually involve the DB\\
Simple object queries & YES & SUCCESS & \\
Nested object queries (involves JOINs) & YES & SUCCESS & \\
Aggregation queries (count) & YES & SUCCESS & We didn't test min, max, avg, etc.\\
Filter queries (involves WHERE) & YES & SUCCESS & \\
Sort queries (involves ORDER BY) & YES & SUCCESS & \\
Distinct queries (involves DISTINCT) & YES & SUCCESS & \\
Limit queries (involves LIMIT) & YES & SUCCESS & \\
Using multiple arguments & NO &  & Doesn't actually involve the DB\\
Multiple queries in a request & NO &  & Doesn't actually involve the DB\\
Multiple variables / aliases / fragments / directives & NO &  & Doesn't actually involve the DB\\
INSERT (see "Perform CRUD operations in API" above & YES & SUCCESS & \\
UPDATE (see "Perform CRUD operations in API" above & YES & SUCCESS & \\
DELETE (see "Perform CRUD operations in API" above & TBD &  & We forgot to test this!\\
ON CONFLICT (an "upsert") & TBD &  & We forgot to test this!\\
Multiple mutations in a request & TBD &  & We forgot to test this!\\
Subscriptions (Live Queries) & TBD & SUCCESS & \\
Test all Postgres/Hasura types (mutation, query) & TBD & SUCCESS & \\
Remote Database & TBD &  & We forgot to test this!\\
Creating event triggers & YES & FAIL & Needs a Hasura fix. See Notes below\\
Creating a chron trigger & TBD & FAIL & Needs a Hasura fix. See Notes below\\
Creating a one-off scheduled event & TBD &  & Needs a Hasura fix\\
Cleaning up scheduled trigger data & TBD &  & Needs a Hasura fix\\
CI/CD: hasura metadata (apply, clear, reload, status) & YES & SUCCESS & \\
CI/CD: hasura migrate (apply, apply --down all, delete) & YES & SUCCESS & \\
\end{tabular}
\end{center}
