edb-test-1/README.html

<div id="outline-container-orga571d6b" class="outline-3">
<h3 id="orga571d6b"><span class="section-number-3">5.1</span> NOTES</h3>
<div class="outline-text-3" id="text-5-1">
<dl class="org-dl">
<dt>Test</dt><dd>do we test this (YES, NO, TBD)</dd>
<dt>YES</dt><dd>we should test this (and have)</dd>
<dt>NO</dt><dd>we may not need to test this</dd>
<dt>TBD</dt><dd>we should test this (but have not yet, possibly because we
cannot)</dd>
<dt>SUCCESS</dt><dd>we tested it and it passed</dd>
<dt>FAIL</dt><dd>we tested it and it did not pass</dd>
<dt>"We forgot to test this!"</dt><dd>either we forgot, or we suspect we may
not need to (e.g. "Remote Database")</dd>
<dt>"Doesn't actually involve the DB"</dt><dd>a Hasura function which we
believe shouldn't work differently on BDR, since the function
doesn't actually interact with the database.</dd>
<dt>"Needs a Hasura fix"</dt><dd>either we have a FAIL test or a TBD test,
because of an identified gap in Hasura that needs to be fixed.</dd>
</dl>
</div>
</div>

<div id="outline-container-orgf7342ba" class="outline-3">
<h3 id="orgf7342ba"><span class="section-number-3">5.2</span> Additional Notes</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Event Trigger creation fails with the following error:
</p>

<div class="org-src-container">
<pre class="src src-json">{
    "internal": {
	"statement": "\n  INSERT INTO hdb_catalog.hdb_source_catalog_version(version, upgraded_on)\n    VALUES ($1, NOW())\n   ON CONFLICT ((version IS NOT NULL))\n   DO UPDATE SET version = $1, upgraded_on = NOW()\n  ",
	"prepared": false,
	"error": {
	    "exec_status": "FatalError",
	    "hint": "To enable updating the table, set REPLICA IDENTITY using ALTER TABLE.",
	    "message": "cannot run INSERT ON CONFLICT DO UPDATE on table \"hdb_source_catalog_version\" because it does not have a replica identity and is part of replication set which publishes updates",
	    "status_code": "55000",
	    "description": null
	},
	"arguments": [
	    "(Oid 25,Just (\"2\",Binary))"
	]
    },
    "path": "$.args[0].args",
    "error": "database query error",
    "code": "unexpected"
}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2022-06-03 Fri 00:00</p>
<p class="author">Author: David A. Ventimiglia</p>
<p class="date">Created: 2022-09-02 Fri 15:34</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
