edb-test-1/README.tex

\subsection{NOTES}
\label{sec:org01b9203}

\begin{description}
\item[{Test}] do we test this (YES, NO, TBD)
\item[{YES}] we should test this (and have)
\item[{NO}] we may not need to test this
\item[{TBD}] we should test this (but have not yet, possibly because we
cannot)
\item[{SUCCESS}] we tested it and it passed
\item[{FAIL}] we tested it and it did not pass
\item[{"We forgot to test this!"}] either we forgot, or we suspect we may
not need to (e.g. "Remote Database")
\item[{"Doesn't actually involve the DB"}] a Hasura function which we
believe shouldn't work differently on BDR, since the function
doesn't actually interact with the database.
\item[{"Needs a Hasura fix"}] either we have a FAIL test or a TBD test,
because of an identified gap in Hasura that needs to be fixed.
\end{description}

\subsection{Additional Notes}
\label{sec:orgfe89b4c}

Event Trigger creation fails with the following error:

\begin{verbatim}
{
    "internal": {
	"statement": "\n  INSERT INTO hdb_catalog.hdb_source_catalog_version(version, upgraded_on)\n    VALUES ($1, NOW())\n   ON CONFLICT ((version IS NOT NULL))\n   DO UPDATE SET version = $1, upgraded_on = NOW()\n  ",
	"prepared": false,
	"error": {
	    "exec_status": "FatalError",
	    "hint": "To enable updating the table, set REPLICA IDENTITY using ALTER TABLE.",
	    "message": "cannot run INSERT ON CONFLICT DO UPDATE on table \"hdb_source_catalog_version\" because it does not have a replica identity and is part of replication set which publishes updates",
	    "status_code": "55000",
	    "description": null
	},
	"arguments": [
	    "(Oid 25,Just (\"2\",Binary))"
	]
    },
    "path": "$.args[0].args",
    "error": "database query error",
    "code": "unexpected"
}
\end{verbatim}
\end{document}
